import React from 'react';
import cl from './Agree.module.css';

function Content() {
  return (
      <div className={cl.Text}>
        <header className={cl.header}>  1. Термины и определения </header>
Покупатель (Потребитель) — физическое лицо, имеющее намерение зарезервировать и/или приобрести товары, либо резервирующее, приобретающее или использующее товары исключительно для личных, семейных, домашних и иных нужд, не связанных с осуществлением предпринимательской деятельности, разместившее Заказ на Сайте https://www.mvideo.ru/ или в Мобильном приложении, либо указанное в Заказе лицо в качестве получателя Товара.

«Продавец — ООО «МВМ», осуществляющее свою деятельность под торговым знаком «М.видео» и реализующее Товары и/или услуги, описание которых представлены на Сайте Продавца. ОГРН 1057746840095 7707548740. 105066, г. Москва, ул. Нижняя Красносельская, д. 40/12 корпус 20, этаж 5 пом. II ком.3 Номер телефона 8-800-600-77-75, Электронная почта 24@mvideo.ru, а также иное лицо, указанное в качестве Продавца в Карточке Товара.
Если в качестве Продавца указано иное лицо, ООО «МВМ» оказывает такому Продавцу услуги по организации реализации Товара через Сайт ООО «МВМ», при этом Продавцом Товара остается такое иное лицо».

Сайт – https://www.mvideo.ru/.

Интернет-магазин «М.видео» – Сайт https://www.mvideo.ru/ или Мобильное приложение, где любой Потребитель может ознакомиться с представленными Товарами, их описанием и ценами на Товары, выбрать определенный способ оплаты и доставки Товаров, отправить Заказ по электронной почте и/или осуществить Заказ по телефону.

Мобильное приложение — программа для электронно-вычислительных машин, предоставляющая доступ к информации о товарах, предназначенной для потенциальных Покупателей.

Дистанционный способ продажи — продажа товаров по договору розничной купли-продажи, заключаемому на основании ознакомления Покупателя с предложенным Продавцом описанием товара, содержащимся на Сайте  https://www.mvideo.ru/ или в Мобильном приложении, при этом должна быть исключена возможность непосредственного ознакомления Покупателя с Товаром либо образцом товара при заключении такого договора.

Товар — объект купли-продажи, не изъятый и не ограниченный в гражданском обороте, представленный к продаже или доступный для резервирования в интернет-магазине «М.видео», посредством размещения в соответствующем разделе интернет-магазина «М.видео» в качестве образца для ознакомления.

Публичная оферта — публичное предложение Продавца, адресованное неопределенному кругу лиц, заключить с Продавцом договор купли-продажи товара дистанционным способом.

Акцепт — полное и безоговорочное принятие Покупателем условий Оферты при совершении Заказа.

Заказ — оформленный по форме Продавца запрос Покупателя на резервирование Товаров интернет-магазина «М.Видео» с возможностью их доставки по указанному в запросе адресу для целей заключения договора купли-продажи, и отправленный Покупателем на сайт или посредством телефонной связи с Оператором Продавца

Оператор — уполномоченное Продавцом лицо, оформляющее заказы товаров по бесплатному телефону: 8-800-600-77-75.

Предварительный Заказ — выражение интереса Покупателя к Товарам, с описанием (технические характеристики, предварительная цена) которых можно ознакомиться на сайте Продавца. На момент совершения предварительного заказа товар может отсутствовать в наличии. В этом случае срок возможной доставки указывается на сайте, а конкретная дата согласовывается с Потребителем после даты, указанной на сайте.

Самовывоз товара — самостоятельное получение и вывоз приобретенного Покупателем Товара с адресов, которые указаны Продавцом на Сайте доступными для заказанного Товара.

Резервирование товара — оформление заказа посредством Предварительного заказа, Самовывоза без предварительной оплаты товара на Сайте для его дальнейшего приобретения в офисах продаж или пунктах выдачи товара. Резервирование Товара без оплаты товара на Сайте не является дистанционным способом продажи. Резервированием товара на Сайте обеспечивается наличие выбранного Потребителем товара для ознакомления с целью заключения договора купли-продажи.

Доставка — услуги по доставке Товара по адресу, указанному Покупателем, и передача его Покупателю либо лицу, указанному Покупателем.

Курьер — лицо, осуществляющее доставку Товаров согласно Заказу Покупателя.

Карта — банковская карта, эмитированная кредитной организацией, позволяющая Покупателю совершать при ее помощи операции с денежными средствами, находящимися у эмитировавшей Карту кредитной организации, в соответствии с законодательством Российской Федерации и договором с кредитной организацией, в том числе операции по оплате Товаров, приобретаемых у Продавца на основании Договора.

Карточка товара — интерфейс Сайта в отношении определенной модели Товара, который содержит описание товара, стоимость и иные характеристики, и (или) функциональные возможности Сайта, которые позволяют оформить Заказ.

Рекламная информация — информация, содержащаяся в брошюрах, баннерах на Сайте о предложениях и акциях, а также иная информация, являющаяся предложением к ознакомлению с новыми товарами, услугами, условиями.

Аккаунт (учетная запись) — это персональная страница Покупателя (личный кабинет), который создаётся после регистрации на Сайте или в Мобильном приложении.

Верификация — процедура проверки номера телефона Покупателя, необходимая для регистрации/авторизации на Сайте и в приложении Продавца, а также при оформлении Заказа:

(а) ввести номер телефона и нажать кнопку «получить код»;

(б) ввести в поле индивидуальный код, направленный владельцу посредством смс-сообщений. Индивидуальный код является простой электронной подписью, которой Клиент подтверждает принадлежность ему указанного номера телефона и его согласие с настоящими Правилами.

Если код совпал, то верификация успешно пройдена: установлена принадлежность номера телефона определённому физическому лицу, чьи данные содержатся в Аккаунте и/или в Заказе («Ваши данные» — «Имя и фамилия»).

Устройство — ноутбук, планшет, мобильный телефон, коммуникатор, смартфон, иное устройство, соответствующее определенным в технической документации на Клиентское приложение системными требованиями и позволяющее использовать Сайт или Приложение по функциональному назначению.

 <header className={cl.header}>  2. Общие положения. </header>

2.1. Заказывая или резервируя Товары через интернет-магазин https://www.mvideo.ru/, Покупатель соглашается с настоящими Правилами продажи Товаров и/или оказания услуг (далее – Условия), изложенными ниже.

2.2. К отношениям между Покупателем и Продавцом применяются положения Закона «О защите прав потребителей» и иные правовые акты РФ, принятые в соответствии с ним.

2.3. Продавец оставляет за собой право вносить изменения в настоящие Правила, в связи с чем Покупатель обязуется регулярно отслеживать изменения в Правилах, размещенных на Сайте.

2.4. Потребитель соглашается с Правилами нажатием кнопки «Подтвердить заказ» или «Перейти к оплате» на последнем этапе оформления Заказа на Сайте.
Также, завершая оформление Заказа, Потребитель подтверждает, что ознакомлен с информацией о Товаре на Сайте, включая, но не ограничиваясь, информацию о характеристиках Товара, о его состоянии, условиях гарантии, комплектации, виде.

2.5. На Покупателя не распространяются условия маркетинговых акций, проводимых на Сайте и предусматривающих вложение дополнительных товаров в Заказы или получение дополнительных привилегий при Заказе, если иное не оговорено непосредственно в условиях проводимой Акции.

2.6. Вся текстовая информация и графические изображения, находящиеся на Сайте, являются собственностью Продавца и/или его Контрагентов.

2.7. При исполнении Заказа Стороны обмениваются информацией друг с другом используя следующие виды связи: электронную почту, систему электронных сообщений (SMS), телефонные звонки. Продавец в соответствии с законодательством Российской Федерации направляет кассовый чек на абонентский номер или адрес электронный почты, указанные Покупателем на Сайте или в Мобильном приложении.
2.8. Покупатель соглашается с тем, что все соглашения, уведомления, соглашения о неразглашении информации и другие документы, предоставленные в электронном виде, соответствуют требованиям действующего законодательства РФ в отношении таких видов обмена информацией.

2.9. Каждая Сторона гарантирует другой Стороне, что обладает необходимой право- и дееспособностью, а равно всеми правами и полномочиями, необходимыми и достаточными для заключения и исполнения договора розничной купли-продажи.

2.10. Вся информация о Товаре доведена до сведения на Сайте Продавца, в технической документации, прилагаемой к Товару, на этикетках, путем нанесения маркировки или иным способом, принятым для отдельных видов товаров, в том числе, при звонке в службу поддержки Продавца.

2.11. Продавец оставляет за собой право вносить изменения в Правила.

2.12. Любые заявления, претензии, требования, письма, поступившие в адрес Продавца после 16.00 рабочего дня по Московскому времени или в праздничный/выходной день, считаются полученными Продавцом на следующий рабочий день.

2.14. Покупатель обязуется не сообщать третьим лицам логин и пароль, указанные при регистрации. В случае возникновения у Покупателя подозрений относительно безопасности его логина и пароля или возможности их несанкционированного использования третьими лицами, Покупатель обязуется незамедлительно уведомить об этом Продавца и изменить регистрационные данные в разделе «Личный кабинет».

2.15. Все информационные материалы, представленные на Сайте, носят справочный характер. Перед оформлением Заказа Покупатель должен обратиться к Продавцу для уточнения свойств и характеристик Товара. Информация о месте изготовления товара указывается в инструкции либо на упаковке товара. Покупатель может также получить информацию до момента заключения договора купли-продажи при звонке специалиста Интернет-Магазина. Некоторые товары Продавца могли быть активированы до продажи. Такие товары являются новыми и не проходили процедуру привязки к пользовательскому аккаунту. Активация не влияет на потребительские характеристики, внешний вид товара, функциональность и иные свойства Товара.

2.16. В случае отсутствия заказанных Товаров у Продавца, в том числе по причинам, не зависящим от последнего, Продавец вправе аннулировать указанный Товар из Заказа Покупателя и уведомить об этом Покупателя путем направления электронного сообщения по адресу либо уведомить Покупателя посредством телефонного звонка, указанного при регистрации.

2.16.1. В случае аннулирования Заказа полностью или частично, стоимость аннулированного Заказа при предоплате Покупателем, Продавец обязуется вернуть денежные средства в течение 10 (десяти) рабочих дней.

2.16.2. При дистанционном способе продажи товара Потребитель вправе отказаться от товара в любое время до его передачи, а после передачи товара - в течение семи дней.

2.16.3.  Возврат товара надлежащего качества возможен в случае, если сохранены его товарный вид, потребительские свойства, а также документ, подтверждающий факт и условия покупки указанного товара. Отсутствие у потребителя документа, подтверждающего факт и условия покупки товара, не лишает его возможности ссылаться на другие доказательства приобретения товара у данного продавца.

2.16.4.  Потребитель не вправе отказаться от товара надлежащего качества, имеющего индивидуально-определенные свойства, если указанный товар может быть использован исключительно приобретающим его потребителем.

2.17. Гарантии и заявления

2.17.1. Продавец не несет ответственность:

за ущерб, причиненный Покупателю вследствие ненадлежащего использования Товаров;
за убытки Покупателя, возникшие в результате неправильного заполнения документов, в том числе неправильного указания регистрационных данных при оформлении Заказа;
за ущерб, причиненный Покупателю вследствие неправомерных действий третьих лиц;
за полное или частичное неисполнение своих обязательств, если такое неисполнение явилось следствием действия обстоятельств непреодолимой силы, возникших после вступления в силу Правил, в результате событий чрезвычайного характера, которые Стороны не могли предвидеть или предотвратить.
2.17.2. Покупатель гарантирует, что:

не является представителем юридического лица/индивидуального предпринимателя;
приобретаемый товар соответствует целям использования;
указал корректный адрес доставки;
указал корректный номер телефона для контактов;
указал корректный адрес электронной почты для контактов;
иная информация, указанная покупателем, является корректной и достоверной;
своими силами и за свой счет обеспечивает безопасность данных, указанных при регистрации, оформлении заказа.
Указание Покупателем недостоверных, некорректных, несуществующих номера телефона, адреса электронной почты, ФИО Пользователя и/или получателя заказа, а также других недостоверных сведений является нарушением настоящих Правил, расценивается как уклонение Покупателя от получения Товара и отказ от договора купли-продажи, а так же является основанием для отмены Заказа. В то же время Покупатель, будучи авторизованным на Сайте, может изменить номер телефона, к которому привязан Аккаунт в личном кабинете. При этом вся указанная в Аккаунте информация и Баллы программы М.Club сохраняются в Аккаунте и после смены номера телефона.

Покупатель может использовать один номер телефона для одного Аккаунта. На одно устройство может приходиться не более двух аккаунтов. Продавец вправе ограничить или заблокировать доступ к использованию Сайта и/или приложений Продавца в случае выявления использования Покупателем нескольких аккаунтов.

2.17.3. Стороны признают, что Продавец считается исполнившим свои обязательства по доставке Товара надлежащим образом, если использовал данные Покупателя, указанные в регистрационной форме.

2.18. В случае, если заказ содержат более 2 единиц товара из одной товарной группы и данный товар не относится к аксессуарам (товары, которые относятся к аксессуарам, всегда находятся в соответствующем разделе каждой товарной группы на сайте), следует обращаться в отдел корпоративных продаж.

2.19. Претензии в электронной форме необходимо направлять на адрес 24@mvideo.ru, или по адресу Москва, ул. Нижняя Красносельская, д. 40/12, корпус 20, этаж 5 пом.II ком.3. В случае, если Продавцом Товара является иное лицо, необходимо обратиться по указанному адресу электронной почты и ООО «МВМ» перенаправит претензию такому Продавцу и/ или предоставит Покупателю информацию о статусе рассмотрения претензии Продавцом».

 <header className={cl.header}>  3. Оформление заказа  </header>

3.1. Заказ Товаров на сайте интернет-магазина.

3.1.1. Размещение Заказа происходит путем нажатия в Карточке товара кнопки «Добавить в корзину»;

3.1.2. Покупатель выбирает способ резервирования товара для Самовывоза или Доставки;

3.1.3. Покупатель выбирает способ оплаты зарезервированного товара для заключения договора купли-продажи;

3.1.4. После оформления заказа, Покупателю отправляется sms/e-mail уведомление об оформлении заказа.

3.2. Заказ/Резервирование Товаров по телефону.

3.2.1. По номеру телефона для заказа Товара, указанному на Сайте Продавца, Покупатель через оператора Продавца посредством телефонного звонка оформляет Заказ.

3.2.2. Покупатель вместе с оператором производят подбор товара, оператор озвучивает стоимость приобретаемых товарных позиций.

3.2.3. Покупатель выбирает способ получения товара из предложенного оператором на выбор: самовывоз - из магазина «М.Видео» или точки партнера; доставка на адрес.

В случае выбора самовывоза Покупателю предлагается выбрать один из возможных адресов, где возможен самовывоз товара. Оператор озвучивает Покупателю ориентировочный срок поступления товара и уточняет у Покупателя контактные данные получателя.

В случае выбора доставки – Покупатель выбирает дату доставки из предложенных оператором, и озвучивает адрес доставки и контактные данные получателя.

Способ получения товара может зависеть от заказываемого товара и его наличия.

Продавец не несет ответственности за некорректно предоставленные покупателем данные.

3.2.4. Покупатель выбирает один из доступных способов оплаты заказанного товара при заключении договора купли-продажи. Доступные способы оплаты товара при заключении договора: заёмными средствами (кредит, рассрочка), оплата online, оплата после осмотра.

3.2.4.1 В случае выбора оплаты заёмными средствами в кредит или рассрочку, покупатель заполняет заявку на сайте, неся ответственность за корректность введенной информации.

3.2.4.2. В случае выбора online-оплаты - оператор озвучивает Покупателю срок на оплату заказа и объясняет Покупателю, каким образом можно оплатить заказ для заключения договора купли-продажи.

Если оплата не произойдёт в указанный срок – договор купли-продажи не будет заключен, и заказ может быть автоматически отменён.

3.3. При выборе опции Самовывоз из магазина, Покупатель резервирует Товар по цене, указанной на Сайте интернет-магазина «М.видео» на момент оформления заказа, с возможностью выбора предварительной оплаты товара (оплата online), или оплаты товара после его осмотра в пункте самовывоза.

На самовывоз из магазина зарезервированного без предварительной оплаты Товара не распространяются правила о дистанционном способе продажи товаров.

3.4.1. Предварительный заказ производится в отношении товаров, которых на момент совершения нет в продаже. Срок и способ получения Товара согласуется с Потребителем представителем Продавца.

3.4.2. При поступлении Товара по предварительному заказу с Потребителем связывается представитель Продавца и согласовывает дату и способ получения Товара Потребителем.

3.4.3. Продавец регистрирует дату и время получения предварительных заказов, Заказы обрабатываются в порядке их получения.

3.4.4. Потребитель имеет право отменить предварительный заказ до момента согласования с Продавцом Заказа.

3.5. Изменение и отмена Заказа/Резервирования.

3.5.1. Покупатель вправе изменить или отменить Заказ/Резервирование в любой момент на сайте, по электронной почте, и/или позвонив по телефону, указанному на Сайте.

3.6. Если после получения Заказа Продавцом обнаруживается, что в наличии отсутствует необходимое количество заказанного Товара, Продавец информирует об этом Покупателя по телефону и/или электронным письмом. В этом случае Продавец вправе отменить заказ, если он не был оплачен Потребителем. В случае, если заказ был предварительно оплачен Потребителем, Продавец осуществляет возврат уплаченных Потребителем за товар денежных средств.

Покупатель вправе согласиться принять Товар в количестве, имеющемся в наличии у Продавца, либо аннулировать данную позицию Товара из Заказа.

3.7. Если покупатель в течение срока резервирования товара не примет товар у Продавца, это расценивается односторонним отказом Покупателя от Договора, что влечёт прекращение  обязательств Продавца, за исключением обязанности вернуть Покупателю уплаченную за товар сумму.

3.7.1. Срок резервирования при выборе способа доставки «Доставка»:

3.7.1.1. Оплата товара «При получении»
Товар резервируется не более чем на 3 дня с плановой даты получения.
3.7.1.2. Оплата товара на сайте
Товар резервируется не более чем на 5 дней с плановой даты получения.

Срок резервирования при выборе способа доставки «Самовывоз»:

3.7.2. Оплата товара при получении + доставка в магазин «М. Видео»
Товар резервируется на 3 дней с момента подтверждения готовности заказа к выдаче.
3.7.2.1. Оплата на сайте + доставка в магазин «М. Видео»
Товар резервируется на 5 дней с момента подтверждения готовности заказа к выдаче.
3.7.2.2. Оплата на сайте + доставка в пункт выдачи «Пятёрочка»
Товар резервируется на 7 дней с момента подтверждения готовности заказа к выдаче.
3.7.2.3. Оплата на сайте + доставка в пункт выдачи «Почта России»
Товар резервируется на 30 дней с момента подтверждения готовности заказа к выдаче.

Срок 5 дней исходя из правил "Закажи и забери" на странице: https://www.mvideo.ru/pickup?from=footer п.4.3

3.8. При исполнении договора купли-продажи представитель Продавца вправе использовать фотосъемку, аудио- и видеозапись, иные способы фиксации факта надлежащей передачи Товара Покупателю. Для подтверждения факта передачи Товара, соответствующего условиям заказа, Продавец вправе, по своему усмотрению, дополнительно оформить акт приема-передачи Товара с Покупателем для отражения фактического состояния Товара на момент его передачи Покупателю. В случае отказа Покупателя от оформления такого акта, Покупатель считается заявившим односторонний отказ от договора купли-продажи такого Товара. В случае отказа Покупателя от оформления акта приема-передачи Товара Продавец принимает отказ покупателя от договора купли-продажи и производит возврат денежных средств за такой Товар в порядке и на условиях, предусмотренных настоящей Офертой.

3.9. Для получения товара Покупатель должен предъявить шестизначный код на каждый заказ. Мы отправили их посредством СМС на номер мобильного телефона, указанного Покупателем при создании заказа.

<header className={cl.header}>  4. Стоимость и оплата   </header>

4.1. Цена, взимаемая за Товар, является ценой на момент размещения Заказа/Резервирования и указывается на Сайте Продавца в описании Товара.

4.2. Продавец вправе изменять цены на Товары в любое время без предварительного уведомления. По подтвержденным Заказам цена на товар изменению не подлежит.

4.3. Покупатель вправе оплатить Товар следующими способами:

4.3.1. оплата банковской картой при получении Товара;

4.3.2. оплата наличными денежными средствами при получении Товара;

4.3.3. оплата банковской картой на Сайте Продавца.

4.4. Подтверждением оплаты является либо кассовый чек, либо иной документ, применяемый на территории Российской Федерации в соответствии с действующим законодательством РФ, подтверждающий оплату Товара.

4.4.1. Согласно действующим Правилам продажи, продавец вправе направлять потребителю кассовый чек с помощью электронных и иных технических средств. На указанные покупателем абонентский номер посредством мессенджеров или СМС, или электронную почту, Продавец направляет ссылку на сайт оператора фискальных данных, переход по которой открывает чек в электронной форме. Чек в электронной форме также доступен покупателю путем сканирования QR-кода со смартфона курьера при доставке.

4.5. Договор купли-продажи считается заключенным с момента оплаты Покупателем заказанных Товаров.

При оплате Товаров Потребителем в пункте самовывоза или офисе продаж и обслуживания на отношения Покупателя и Продавца распространяются нормы о розничной купле-продаже товаров и не распространяются правила и нормы о дистанционной продаже товара.

<header className={cl.header}>  5. Гарантии и условия ограничений.   </header>

5.1. Совершая Заказ, Покупатель подтверждает и гарантирует что:

Согласен с тем, что к его Аккаунту могут быть применены любые ограничения (в том числе блокировка на любой срок), связанные с обеспечением безопасности, в рамках исполнения действующего законодательства Российской Федерации, в случае нарушения законных прав и интересов третьих лиц и/или в связи с нарушением Покупателем настоящих условий, а также по причинам технического характера. Кроме того, принимая настоящие условия;

Согласен с тем, что ограничения на его Аккаунте могут быть применены в любое время без объяснения причин и без уведомления Покупателя.

5.2. Продавец вправе ограничить или заблокировать доступ Покупателя к использованию интернет-магазина и/или мобильного приложения в случае выявления использования одним Покупателем нескольких аккаунтов и/или с целью защиты Аккаунта при обнаружении подозрительной активности, к которой может быть отнесено использование веб-инструментов для автоматизации доступа к сайту или приложениям Продавца. Если Продавцом будет выявлено совершение заказов Покупателем с целью получения коммерческой выгоды вследствие перепродажи, обнаружены факты скупки или перепродажи Покупателем большого количества Товаров/Продуктов цифрового контента, Продавец оставляет за собой право ограничить или полностью заблокировать доступ к использованию интернет-магазина и/или мобильного приложения такому Покупателю.

Защита персональных данных

При оформлении заказа на Сайте Продавца, Покупатель предоставляет о себе следующую информацию: фамилия, имя, отчество, номер контактного телефона (мобильного и/или домашнего), адрес электронной почты, адрес доставки Заказа и иные необходимые данные (далее – персональные данные).

Персональные данные Покупателя будут обрабатываться Продавцом способами включающими: сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (предоставление, доступ), обезличивание, блокирование, удаление, уничтожение, в т.ч. с использованием средств автоматизации или без использования таких средств, в целях продажи Товаров и/или оказания услуг, изложенных в настоящих Правилах, включая, но не ограничиваясь информированием о Заказе, ведением претензионной работы, анализом качества предоставляемого Компанией сервиса и улучшением качества обслуживания клиентов Компании, оказанием услуг по доставке, установке и ремонту Товара, реализацией возможности возврата Товара, оказанием услуги по проверке качества товара/экспертизы. Покупатель также подтверждает, что ознакомлен с Политикой в отношении обработки персональных данных ООО «МВМ», опубликованной на Сайте.

В целях исполнения своих обязательств перед Покупателем Продавец вправе передавать персональные данные Покупателей третьим лицам. Со списком третьих лиц можно ознакомиться на Сайте.

Продавец гарантирует, что осуществляет обработку и обеспечивает защиту персональных данных в соответствии с действующим законодательством Российской Федерации. Обработка персональных данных Покупателя осуществляется на территории Российской Федерации.
      </div>
  );
};

export default Content;