
import { Link } from 'react-router-dom';
import { Logo } from './logo';
import footer from './styles/footer.module.css';

export const Footer = () => {

	return (
		<footer className={footer.info}>
			<div className={footer.main}>
				<div className={footer.infoLeft}>
					<div className={footer.support}>
						<Logo />
						<span className={footer.supportTxt}>
							support@stabledraw.com
						</span>
						<div className={footer.media}>
							<Link to='https://vk.com/stabledraw' className={footer.iconBorder} target="_blank" rel="noopener noreferrer">
								<svg xmlns="http://www.w3.org/2000/svg" width="45" height="45" viewBox="0 0 45 45" fill="none">
									<path d="M23.6053 30.375C15.1492 30.375 10.326 24.4628 10.125 14.625H14.3608C14.4999 21.8457 17.6227 24.9043 20.0961 25.5349V14.625H24.0846V20.8525C26.5271 20.5845 29.0933 17.7466 29.959 14.625H33.9475C33.6212 16.244 32.971 17.7769 32.0373 19.1278C31.1036 20.4788 29.9067 21.6187 28.5213 22.4764C30.0677 23.26 31.4336 24.3692 32.5288 25.7307C33.624 27.0922 34.4237 28.6752 34.875 30.375H30.4846C30.0795 28.8986 29.2561 27.5769 28.1176 26.5757C26.9791 25.5744 25.5761 24.9382 24.0846 24.7466V30.375H23.6053Z" fill="white" />
								</svg>
							</Link>
							<Link to='https://t.me/StableDraw' className={footer.iconBorderTg} target="_blank" rel="noopener noreferrer">
								<svg xmlns="http://www.w3.org/2000/svg" width="45" height="45" viewBox="0 0 45 45" fill="none">
									<path d="M35 15.7528L31.2432 35.3653C31.2432 35.3653 30.7176 36.7251 29.2736 36.073L20.6057 29.1907L20.5655 29.1704C21.7364 28.0817 30.8155 19.6283 31.2123 19.2452C31.8266 18.6517 31.4452 18.2984 30.732 18.7467L17.321 27.5662L12.147 25.7635C12.147 25.7635 11.3328 25.4635 11.2545 24.8114C11.1751 24.1582 12.1738 23.8049 12.1738 23.8049L33.2664 15.2362C33.2664 15.2362 35 14.4474 35 15.7528Z" fill="white" />
								</svg>
							</Link>
							<Link to='https://instagram.com/stable_draw?igshid=MzRlODBiNWFlZA==' className={footer.iconBorder} target="_blank" rel="noopener noreferrer">
								<svg xmlns="http://www.w3.org/2000/svg" width="50" height="50" viewBox="0 0 50 50" fill="none">
									<path d="M25 14.759C28.3133 14.759 28.7651 14.759 30.1205 14.759C31.3253 14.759 31.9277 15.0602 32.3795 15.2108C32.9819 15.512 33.4337 15.6627 33.8855 16.1145C34.3374 16.5663 34.6386 17.0181 34.7892 17.6205C34.9398 18.0723 35.0904 18.6747 35.241 19.8795C35.241 21.2349 35.241 21.5361 35.241 25C35.241 28.4639 35.241 28.7651 35.241 30.1205C35.241 31.3253 34.9398 31.9277 34.7892 32.3795C34.488 32.9819 34.3374 33.4337 33.8855 33.8855C33.4337 34.3374 32.9819 34.6386 32.3795 34.7892C31.9277 34.9398 31.3253 35.0904 30.1205 35.241C28.7651 35.241 28.4639 35.241 25 35.241C21.5361 35.241 21.2349 35.241 19.8795 35.241C18.6747 35.241 18.0723 34.9398 17.6205 34.7892C17.0181 34.488 16.5663 34.3374 16.1145 33.8855C15.6627 33.4337 15.3614 32.9819 15.2108 32.3795C15.0602 31.9277 14.9096 31.3253 14.759 30.1205C14.759 28.7651 14.759 28.4639 14.759 25C14.759 21.5361 14.759 21.2349 14.759 19.8795C14.759 18.6747 15.0602 18.0723 15.2108 17.6205C15.512 17.0181 15.6627 16.5663 16.1145 16.1145C16.5663 15.6627 17.0181 15.3614 17.6205 15.2108C18.0723 15.0602 18.6747 14.9096 19.8795 14.759C21.2349 14.759 21.6867 14.759 25 14.759ZM25 12.5C21.5361 12.5 21.2349 12.5 19.8795 12.5C18.5241 12.5 17.6205 12.8012 16.8675 13.1024C16.1145 13.4036 15.3614 13.8554 14.6084 14.6084C13.8554 15.3614 13.5542 15.9639 13.1024 16.8675C12.8012 17.6205 12.6506 18.5241 12.5 19.8795C12.5 21.2349 12.5 21.6867 12.5 25C12.5 28.4639 12.5 28.7651 12.5 30.1205C12.5 31.4759 12.8012 32.3795 13.1024 33.1325C13.4036 33.8855 13.8554 34.6386 14.6084 35.3916C15.3614 36.1446 15.9639 36.4458 16.8675 36.8976C17.6205 37.1988 18.5241 37.3494 19.8795 37.5C21.2349 37.5 21.6867 37.5 25 37.5C28.3133 37.5 28.7651 37.5 30.1205 37.5C31.4759 37.5 32.3795 37.1988 33.1325 36.8976C33.8855 36.5964 34.6386 36.1446 35.3916 35.3916C36.1446 34.6386 36.4458 34.0361 36.8976 33.1325C37.1988 32.3795 37.3494 31.4759 37.5 30.1205C37.5 28.7651 37.5 28.3133 37.5 25C37.5 21.6867 37.5 21.2349 37.5 19.8795C37.5 18.5241 37.1988 17.6205 36.8976 16.8675C36.5964 16.1145 36.1446 15.3614 35.3916 14.6084C34.6386 13.8554 34.0361 13.5542 33.1325 13.1024C32.3795 12.8012 31.4759 12.6506 30.1205 12.5C28.7651 12.5 28.4639 12.5 25 12.5Z" fill="white" />
									<path d="M25 18.5241C21.3855 18.5241 18.5241 21.3855 18.5241 25C18.5241 28.6145 21.3855 31.4759 25 31.4759C28.6145 31.4759 31.4759 28.6145 31.4759 25C31.4759 21.3855 28.6145 18.5241 25 18.5241ZM25 29.2169C22.741 29.2169 20.7831 27.4096 20.7831 25C20.7831 22.741 22.5904 20.7831 25 20.7831C27.259 20.7831 29.2169 22.5904 29.2169 25C29.2169 27.259 27.259 29.2169 25 29.2169Z" fill="white" />
									<path d="M31.6265 19.8795C32.4583 19.8795 33.1325 19.2052 33.1325 18.3735C33.1325 17.5417 32.4583 16.8675 31.6265 16.8675C30.7948 16.8675 30.1205 17.5417 30.1205 18.3735C30.1205 19.2052 30.7948 19.8795 31.6265 19.8795Z" fill="white" />
								</svg>
							</Link>
						</div>
					</div>
					<span className={footer.addressTxt}>
						ООО "Стейбл Дроу", 630112, г. Новосибирск, ул. Гоголя, д. 192, кв. 71
					</span>
				</div>

				<div className={footer.infoRight}>
					<span className={footer.txtRight}>
						Пользовательское соглашение
					</span>
					<span className={footer.txtRight}>
						Политика оплаты и возврата
					</span>
					<div className={footer.infoCont}>
						<span className={footer.txtRight}>
							Помощь
						</span>
						<Link to='/aboutUs' className={footer.link}>
							<span className={footer.txtRight}>
								О нас
							</span>
						</Link>
					</div>
				</div>
			</div>
			<div className={footer.box_docs}>
				<div className={footer.left_docs}>
					<span className={footer.docs}>
						<span>ИНН/КПП:</span> 5405088796/540501001
					</span>
					<span className={footer.docs}>
						<span>ОГРН:</span> 123540003826
					</span>
					<span className={footer.docs}>
						<span>Место нахождения:</span><br />630112, г. Новосибирск, ул. Гоголя, д. 192, кв. 71
					</span>
					<span className={footer.docs}>
						<span>Телефон:</span> +7-913-786-9887;
					</span>
				</div>
				<div className={footer.right_docs}>
					<span className={footer.docs}>
						<span>Код ОКВЭД:</span> 62.01 «Разработка компьютерного программного обеспечения»
					</span>
					<span className={footer.docs}>
						<span>Стек используемых технологий:</span> <br />ASP.NET Core, .NET 7, MinIo, RabbitMQ, Masstransit, Docker Compose, MediatR, Propan, Sqlite, Entity Framework Core, Nginx, React, MobX, PyTorch
					</span>
					<span className={footer.docs}>
						<span>Языки программирования:</span> C#, Typescript, Python, HTML, CSS
					</span>
				</div>
			</div>
		</footer>
	)
}